# -*- coding: utf-8 -*-
"""
Created on Sat Jun  1 22:31:00 2019

@author: yuwei
"""


'特征合并与svc'

#%%
"特征合并在算法中很常用,这里介绍行列合并方式"
import numpy as np
a = [[1,2,3],[2,3,4]]
b = [[3,4,5],[2,3,1]]
#针对行上的合并
print(np.hstack((a,b)))
#针对行上的合并
print(np.vstack((a,b)))


#%%
"支持向量机调用示例"
from sklearn.svm import SVC
#训练集
X_train = [[1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1],
           [0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0],
           [1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0],
           [0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0],
           [1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1],
           [0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1],
           [1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0],
           [0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0]]
#标签
y_train = [1, 0, 1, 0, 0, 1, 0, 0]
#模型定义 
clf = SVC(kernel='linear', C=0.4)
#模型训练
clf.fit(X_train, y_train)
#对于新样本进行预测
print(clf.predict([[0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1]]))

